CycleTrader-api/app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_user
      user = User.find(params[:id])