CycleTrader-api/app/controllers/bicycles_controller.rb

SELECT "bicycles".* FROM "bicycles"
---
  def index
    @bicycles = Bicycle.all

UPDATE "bicycles" SET "brand" = $1, "model" = $2, "size" = $3, "rearG" = $4, "gearset" = $5, "condition" = $6, "updated_at" = $7 WHERE "bicycles"."id" = $8  [["brand", "asdlkfjadsf"], ["model", "wefewf"], ["size", 4], ["rearG", 3], ["gearset", "Shimano"], ["condition", "excellent"], ["updated_at", "2020-10-23 16:33:52.108726"], ["id", 3]]
---
  def update
    if @bicycle.update(bicycle_params)

DELETE FROM "bicycles" WHERE "bicycles"."id" = $1  [["id", 1]]
---
  def destroy
    @bicycle.destroy

SELECT "bicycles".* FROM "bicycles" WHERE "bicycles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_bicycle
      @bicycle = Bicycle.find(params[:id])